# -*- coding: utf-8 -*-

# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

# В этом модуле создать рецепт двойного чизбургера (https://goo.gl/zA3goZ)
# с помощью фукций из my_burger и вывести на консоль.

# Создать рецепт своего бургера, по вашему вкусу.
# Если не хватает инградиентов - создать соответствующие функции в модуле my_burger

import my_burger as mb


def my_burger():
    mb.add_bread()
    mb.add_cutlet()
    mb.add_mayo()
    mb.add_tomato()
    mb.add_cucumber()
    mb.add_cheese()
    mb.add_sauce()
    mb.add_flavor()
    mb.add_bread()


my_burger()
